app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."title" = ? LIMIT 1  [["title", "Caught Up in You"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      if !Song.find_by(title: song[0])